### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
[0m[1mmodule.sync_check.data.external.sources_tar: Reading...[0m[0m
[0m[1mmodule.sync_check.data.local_file.init: Reading...[0m[0m
[0m[1mmodule.sync_check.data.local_file.init: Read complete after 0s [id=780dfd72dc5eb9ab0f94783345bf1414423573e0][0m
[0m[1mmodule.sync_check.data.digitalocean_project.forest_project: Reading...[0m[0m
[0m[1mmodule.sync_check.data.digitalocean_ssh_keys.keys: Reading...[0m[0m
[0m[1mmodule.sync_check.data.external.sources_tar: Read complete after 0s [id=-][0m
[0m[1mmodule.sync_check.data.local_file.sources: Reading...[0m[0m
[0m[1mmodule.sync_check.data.local_file.sources: Read complete after 0s [id=5c6fc9fdb667a2a17050c78e766238a2fe8f6263][0m
[0m[1mmodule.sync_check.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/14512061520513425405][0m
[0m[1mmodule.sync_check.digitalocean_droplet.forest: Refreshing state... [id=378138319][0m
[0m[1mmodule.sync_check.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411][0m
[0m[1mmodule.sync_check.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.sync_check.digitalocean_droplet.forest[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "digitalocean_droplet" "forest" {
      [33m~[0m[0m created_at           = "2023-10-05T11:08:58Z" -> (known after apply)
      [33m~[0m[0m disk                 = 200 -> (known after apply)
      [33m~[0m[0m id                   = "378138319" -> (known after apply)
      [33m~[0m[0m ipv4_address         = "134.122.94.217" -> (known after apply)
      [33m~[0m[0m ipv4_address_private = "10.135.0.8" -> (known after apply)
      [32m+[0m[0m ipv6_address         = (known after apply)
      [33m~[0m[0m locked               = false -> (known after apply)
      [33m~[0m[0m memory               = 16384 -> (known after apply)
        name                 = "forest-sync-check"
      [33m~[0m[0m price_hourly         = 0.125 -> (known after apply)
      [33m~[0m[0m price_monthly        = 84 -> (known after apply)
      [33m~[0m[0m private_networking   = true -> (known after apply)
      [33m~[0m[0m status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      [33m~[0m[0m urn                  = "do:droplet:378138319" -> (known after apply)
      [33m~[0m[0m user_data            = "3144cc94da62e7c3e24b3283f3d94320ce57f899" [33m->[0m[0m "6edab8f6ffafe3c00efadbc3b59a461ae09acf31" [31m# forces replacement[0m[0m
      [33m~[0m[0m vcpus                = 4 -> (known after apply)
      [33m~[0m[0m volume_ids           = [] -> (known after apply)
      [33m~[0m[0m vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.sync_check.digitalocean_project_resources.connect_forest_project[0m will be updated in-place
[0m  [33m~[0m[0m resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      [33m~[0m[0m resources = [
          [31m-[0m[0m "do:droplet:378138319",
        ] -> (known after apply)
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 1 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m ip = [
      [31m-[0m[0m [
          [31m-[0m[0m "134.122.94.217",
        ],
      [32m+[0m[0m [
          [32m+[0m[0m [90mnull[0m[0m,
        ],
    ]
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>